[command]/home/runner/work/_temp/14058479-27ef-41a1-8302-c53935ec2e67/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.resource_group["rg01"].azurerm_resource_group.resource_group will be created
  + resource "azurerm_resource_group" "resource_group" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "githubaction-rg-01"
    }

  # module.storage_account["stg01"].azurerm_storage_account.stg01 will be created
  + resource "azurerm_storage_account" "stg01" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = "githubactionstg01"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "githubaction-rg-01"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.storage_account["stg02"].azurerm_storage_account.stg01 will be created
  + resource "azurerm_storage_account" "stg01" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = "githubactionstg02"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "githubaction-rg-01"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.resource_group["rg01"].azurerm_resource_group.resource_group will be created%0A  + resource "azurerm_resource_group" "resource_group" {%0A      + id       = (known after apply)%0A      + location = "eastus"%0A      + name     = "githubaction-rg-01"%0A    }%0A%0A  # module.storage_account["stg01"].azurerm_storage_account.stg01 will be created%0A  + resource "azurerm_storage_account" "stg01" {%0A      + access_tier                        = (known after apply)%0A      + account_kind                       = "StorageV2"%0A      + account_replication_type           = "LRS"%0A      + account_tier                       = "Standard"%0A      + allow_nested_items_to_be_public    = true%0A      + cross_tenant_replication_enabled   = false%0A      + default_to_oauth_authentication    = false%0A      + dns_endpoint_type                  = "Standard"%0A      + https_traffic_only_enabled         = true%0A      + id                                 = (known after apply)%0A      + infrastructure_encryption_enabled  = false%0A      + is_hns_enabled                     = false%0A      + large_file_share_enabled           = (known after apply)%0A      + local_user_enabled                 = true%0A      + location                           = "eastus"%0A      + min_tls_version                    = "TLS1_2"%0A      + name                               = "githubactionstg01"%0A      + nfsv3_enabled                      = false%0A      + primary_access_key                 = (sensitive value)%0A      + primary_blob_connection_string     = (sensitive value)%0A      + primary_blob_endpoint              = (known after apply)%0A      + primary_blob_host                  = (known after apply)%0A      + primary_blob_internet_endpoint     = (known after apply)%0A      + primary_blob_internet_host         = (known after apply)%0A      + primary_blob_microsoft_endpoint    = (known after apply)%0A      + primary_blob_microsoft_host        = (known after apply)%0A      + primary_connection_string          = (sensitive value)%0A      + primary_dfs_endpoint               = (known after apply)%0A      + primary_dfs_host                   = (known after apply)%0A      + primary_dfs_internet_endpoint      = (known after apply)%0A      + primary_dfs_internet_host          = (known after apply)%0A      + primary_dfs_microsoft_endpoint     = (known after apply)%0A      + primary_dfs_microsoft_host         = (known after apply)%0A      + primary_file_endpoint              = (known after apply)%0A      + primary_file_host                  = (known after apply)%0A      + primary_file_internet_endpoint     = (known after apply)%0A      + primary_file_internet_host         = (known after apply)%0A      + primary_file_microsoft_endpoint    = (known after apply)%0A      + primary_file_microsoft_host        = (known after apply)%0A      + primary_location                   = (known after apply)%0A      + primary_queue_endpoint             = (known after apply)%0A      + primary_queue_host                 = (known after apply)%0A      + primary_queue_microsoft_endpoint   = (known after apply)%0A      + primary_queue_microsoft_host       = (known after apply)%0A      + primary_table_endpoint             = (known after apply)%0A      + primary_table_host                 = (known after apply)%0A      + primary_table_microsoft_endpoint   = (known after apply)%0A      + primary_table_microsoft_host       = (known after apply)%0A      + primary_web_endpoint               = (known after apply)%0A      + primary_web_host                   = (known after apply)%0A      + primary_web_internet_endpoint      = (known after apply)%0A      + primary_web_internet_host          = (known after apply)%0A      + primary_web_microsoft_endpoint     = (known after apply)%0A      + primary_web_microsoft_host         = (known after apply)%0A      + public_network_access_enabled      = true%0A      + queue_encryption_key_type          = "Service"%0A      + resource_group_name                = "githubaction-rg-01"%0A      + secondary_access_key               = (sensitive value)%0A      + secondary_blob_connection_string   = (sensitive value)%0A      + secondary_blob_endpoint            = (known after apply)%0A      + secondary_blob_host                = (known after apply)%0A      + secondary_blob_internet_endpoint   = (known after apply)%0A      + secondary_blob_internet_host       = (known after apply)%0A      + secondary_blob_microsoft_endpoint  = (known after apply)%0A      + secondary_blob_microsoft_host      = (known after apply)%0A      + secondary_connection_string        = (sensitive value)%0A      + secondary_dfs_endpoint             = (known after apply)%0A      + secondary_dfs_host                 = (known after apply)%0A      + secondary_dfs_internet_endpoint    = (known after apply)%0A      + secondary_dfs_internet_host        = (known after apply)%0A      + secondary_dfs_microsoft_endpoint   = (known after apply)%0A      + secondary_dfs_microsoft_host       = (known after apply)%0A      + secondary_file_endpoint            = (known after apply)%0A      + secondary_file_host                = (known after apply)%0A      + secondary_file_internet_endpoint   = (known after apply)%0A      + secondary_file_internet_host       = (known after apply)%0A      + secondary_file_microsoft_endpoint  = (known after apply)%0A      + secondary_file_microsoft_host      = (known after apply)%0A      + secondary_location                 = (known after apply)%0A      + secondary_queue_endpoint           = (known after apply)%0A      + secondary_queue_host               = (known after apply)%0A      + secondary_queue_microsoft_endpoint = (known after apply)%0A      + secondary_queue_microsoft_host     = (known after apply)%0A      + secondary_table_endpoint           = (known after apply)%0A      + secondary_table_host               = (known after apply)%0A      + secondary_table_microsoft_endpoint = (known after apply)%0A      + secondary_table_microsoft_host     = (known after apply)%0A      + secondary_web_endpoint             = (known after apply)%0A      + secondary_web_host                 = (known after apply)%0A      + secondary_web_internet_endpoint    = (known after apply)%0A      + secondary_web_internet_host        = (known after apply)%0A      + secondary_web_microsoft_endpoint   = (known after apply)%0A      + secondary_web_microsoft_host       = (known after apply)%0A      + sftp_enabled                       = false%0A      + shared_access_key_enabled          = true%0A      + table_encryption_key_type          = "Service"%0A%0A      + blob_properties (known after apply)%0A%0A      + network_rules (known after apply)%0A%0A      + queue_properties (known after apply)%0A%0A      + routing (known after apply)%0A%0A      + share_properties (known after apply)%0A%0A      + static_website (known after apply)%0A    }%0A%0A  # module.storage_account["stg02"].azurerm_storage_account.stg01 will be created%0A  + resource "azurerm_storage_account" "stg01" {%0A      + access_tier                        = (known after apply)%0A      + account_kind                       = "StorageV2"%0A      + account_replication_type           = "LRS"%0A      + account_tier                       = "Standard"%0A      + allow_nested_items_to_be_public    = true%0A      + cross_tenant_replication_enabled   = false%0A      + default_to_oauth_authentication    = false%0A      + dns_endpoint_type                  = "Standard"%0A      + https_traffic_only_enabled         = true%0A      + id                                 = (known after apply)%0A      + infrastructure_encryption_enabled  = false%0A      + is_hns_enabled                     = false%0A      + large_file_share_enabled           = (known after apply)%0A      + local_user_enabled                 = true%0A      + location                           = "eastus"%0A      + min_tls_version                    = "TLS1_2"%0A      + name                               = "githubactionstg02"%0A      + nfsv3_enabled                      = false%0A      + primary_access_key                 = (sensitive value)%0A      + primary_blob_connection_string     = (sensitive value)%0A      + primary_blob_endpoint              = (known after apply)%0A      + primary_blob_host                  = (known after apply)%0A      + primary_blob_internet_endpoint     = (known after apply)%0A      + primary_blob_internet_host         = (known after apply)%0A      + primary_blob_microsoft_endpoint    = (known after apply)%0A      + primary_blob_microsoft_host        = (known after apply)%0A      + primary_connection_string          = (sensitive value)%0A      + primary_dfs_endpoint               = (known after apply)%0A      + primary_dfs_host                   = (known after apply)%0A      + primary_dfs_internet_endpoint      = (known after apply)%0A      + primary_dfs_internet_host          = (known after apply)%0A      + primary_dfs_microsoft_endpoint     = (known after apply)%0A      + primary_dfs_microsoft_host         = (known after apply)%0A      + primary_file_endpoint              = (known after apply)%0A      + primary_file_host                  = (known after apply)%0A      + primary_file_internet_endpoint     = (known after apply)%0A      + primary_file_internet_host         = (known after apply)%0A      + primary_file_microsoft_endpoint    = (known after apply)%0A      + primary_file_microsoft_host        = (known after apply)%0A      + primary_location                   = (known after apply)%0A      + primary_queue_endpoint             = (known after apply)%0A      + primary_queue_host                 = (known after apply)%0A      + primary_queue_microsoft_endpoint   = (known after apply)%0A      + primary_queue_microsoft_host       = (known after apply)%0A      + primary_table_endpoint             = (known after apply)%0A      + primary_table_host                 = (known after apply)%0A      + primary_table_microsoft_endpoint   = (known after apply)%0A      + primary_table_microsoft_host       = (known after apply)%0A      + primary_web_endpoint               = (known after apply)%0A      + primary_web_host                   = (known after apply)%0A      + primary_web_internet_endpoint      = (known after apply)%0A      + primary_web_internet_host          = (known after apply)%0A      + primary_web_microsoft_endpoint     = (known after apply)%0A      + primary_web_microsoft_host         = (known after apply)%0A      + public_network_access_enabled      = true%0A      + queue_encryption_key_type          = "Service"%0A      + resource_group_name                = "githubaction-rg-01"%0A      + secondary_access_key               = (sensitive value)%0A      + secondary_blob_connection_string   = (sensitive value)%0A      + secondary_blob_endpoint            = (known after apply)%0A      + secondary_blob_host                = (known after apply)%0A      + secondary_blob_internet_endpoint   = (known after apply)%0A      + secondary_blob_internet_host       = (known after apply)%0A      + secondary_blob_microsoft_endpoint  = (known after apply)%0A      + secondary_blob_microsoft_host      = (known after apply)%0A      + secondary_connection_string        = (sensitive value)%0A      + secondary_dfs_endpoint             = (known after apply)%0A      + secondary_dfs_host                 = (known after apply)%0A      + secondary_dfs_internet_endpoint    = (known after apply)%0A      + secondary_dfs_internet_host        = (known after apply)%0A      + secondary_dfs_microsoft_endpoint   = (known after apply)%0A      + secondary_dfs_microsoft_host       = (known after apply)%0A      + secondary_file_endpoint            = (known after apply)%0A      + secondary_file_host                = (known after apply)%0A      + secondary_file_internet_endpoint   = (known after apply)%0A      + secondary_file_internet_host       = (known after apply)%0A      + secondary_file_microsoft_endpoint  = (known after apply)%0A      + secondary_file_microsoft_host      = (known after apply)%0A      + secondary_location                 = (known after apply)%0A      + secondary_queue_endpoint           = (known after apply)%0A      + secondary_queue_host               = (known after apply)%0A      + secondary_queue_microsoft_endpoint = (known after apply)%0A      + secondary_queue_microsoft_host     = (known after apply)%0A      + secondary_table_endpoint           = (known after apply)%0A      + secondary_table_host               = (known after apply)%0A      + secondary_table_microsoft_endpoint = (known after apply)%0A      + secondary_table_microsoft_host     = (known after apply)%0A      + secondary_web_endpoint             = (known after apply)%0A      + secondary_web_host                 = (known after apply)%0A      + secondary_web_internet_endpoint    = (known after apply)%0A      + secondary_web_internet_host        = (known after apply)%0A      + secondary_web_microsoft_endpoint   = (known after apply)%0A      + secondary_web_microsoft_host       = (known after apply)%0A      + sftp_enabled                       = false%0A      + shared_access_key_enabled          = true%0A      + table_encryption_key_type          = "Service"%0A%0A      + blob_properties (known after apply)%0A%0A      + network_rules (known after apply)%0A%0A      + queue_properties (known after apply)%0A%0A      + routing (known after apply)%0A%0A      + share_properties (known after apply)%0A%0A      + static_website (known after apply)%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
